MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAMV71N21B/mcu.h
/**
 * \file
 *
 * \brief Header file for ATSAMV71N21B
 *
 * Copyright (c) 2019 Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

/* file generated from device description version 2019-01-18T21:21:09Z */
#ifndef _SAMV71N21B_H_
#define _SAMV71N21B_H_

/** \addtogroup SAMV71N21B_definitions SAMV71N21B definitions
  This file defines all structures and symbols for SAMV71N21B:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
 *  @{
 */

#ifdef __cplusplus
 extern "C" {
#endif

/** \defgroup Atmel_glob_defs Atmel Global Defines

    <strong>IO Type Qualifiers</strong> are used
    \li to specify the access to peripheral variables.
    \li for automatic generation of peripheral register debug information.

    \remark
    CMSIS core has a syntax that differs from this using i.e. __I, __O, or __IO followed by 'uint<size>_t' respective types.
    Default the header files will follow the CMSIS core syntax.
 *  @{
 */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>

/* IO definitions (access restrictions to peripheral registers) */
#ifndef __cplusplus
typedef volatile const uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile const uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile const uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#else
typedef volatile       uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile       uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile       uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#endif
typedef volatile       uint32_t WoReg;   /**< Write only 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t WoReg16; /**< Write only 16-bit register (volatile unsigned int) */
typedef volatile       uint8_t  WoReg8;  /**< Write only  8-bit register (volatile unsigned int) */
typedef volatile       uint32_t RwReg;   /**< Read-Write 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t RwReg16; /**< Read-Write 16-bit register (volatile unsigned int) */
typedef volatile       uint8_t  RwReg8;  /**< Read-Write  8-bit register (volatile unsigned int) */

#define CAST(type, value) ((type *)(value)) /**< Pointer Type Conversion Macro for C/C++ */
#define REG_ACCESS(type, address) (*(type*)(address)) /**< C code: Register value */
#else /* Assembler */
#define CAST(type, value) (value) /**< Pointer Type Conversion Macro for Assembler */
#define REG_ACCESS(type, address) (address) /**< Assembly code: Register address */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !defined(SKIP_INTEGER_LITERALS)

#if defined(_U_) || defined(_L_) || defined(_UL_)
  #error "Integer Literals macros already defined elsewhere"
#endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Macros that deal with adding suffixes to integer literal constants for C/C++ */
#define _U_(x) x ## U    /**< C code: Unsigned integer literal constant value */
#define _L_(x) x ## L    /**< C code: Long integer literal constant value */
#define _UL_(x) x ## UL  /**< C code: Unsigned Long integer literal constant value */

#else /* Assembler */

#define _U_(x) x    /**< Assembler: Unsigned integer literal constant value */
#define _L_(x) x    /**< Assembler: Long integer literal constant value */
#define _UL_(x) x   /**< Assembler: Unsigned Long integer literal constant value */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#endif /* SKIP_INTEGER_LITERALS */
/** @}  end of Atmel Global Defines */

/** \addtogroup SAMV71N21B_cmsis CMSIS Definitions
 *  @{
 */
/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR SAMV71N21B */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** Interrupt Number Definition */
typedef enum IRQn
{
/******  CORTEX-M7 Processor Exceptions Numbers ******************************/
  Reset_IRQn                = -15, /**< 1   Reset Vector, invoked on Power up and warm reset  */
  NonMaskableInt_IRQn       = -14, /**< 2   Non maskable Interrupt, cannot be stopped or preempted  */
  HardFault_IRQn            = -13, /**< 3   Hard Fault, all classes of Fault     */
  MemoryManagement_IRQn     = -12, /**< 4   Memory Management, MPU mismatch, including Access Violation and No Match  */
  BusFault_IRQn             = -11, /**< 5   Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault  */
  UsageFault_IRQn           = -10, /**< 6   Usage Fault, i.e. Undef Instruction, Illegal State Transition  */
  SVCall_IRQn               = -5 , /**< 11  System Service Call via SVC instruction  */
  DebugMonitor_IRQn         = -4 , /**< 12  Debug Monitor                        */
  PendSV_IRQn               = -2 , /**< 14  Pendable request for system service  */
  SysTick_IRQn              = -1 , /**< 15  System Tick Timer                    */
/******  SAMV71N21B specific Interrupt Numbers ***********************************/
  SUPC_IRQn                 = 0  , /**< 0   SAMV71N21B Supply Controller (SUPC) */
  RSTC_IRQn                 = 1  , /**< 1   SAMV71N21B Reset Controller (RSTC)  */
  RTC_IRQn                  = 2  , /**< 2   SAMV71N21B Real-time Clock (RTC)    */
  RTT_IRQn                  = 3  , /**< 3   SAMV71N21B Real-time Timer (RTT)    */
  WDT_IRQn                  = 4  , /**< 4   SAMV71N21B Watchdog Timer (WDT)     */
  PMC_IRQn                  = 5  , /**< 5   SAMV71N21B Power Management Controller (PMC) */
  EFC_IRQn                  = 6  , /**< 6   SAMV71N21B Embedded Flash Controller (EFC) */
  UART0_IRQn                = 7  , /**< 7   SAMV71N21B Universal Asynchronous Receiver Transmitter (UART0) */
  UART1_IRQn                = 8  , /**< 8   SAMV71N21B Universal Asynchronous Receiver Transmitter (UART1) */
  PIOA_IRQn                 = 10 , /**< 10  SAMV71N21B Parallel Input/Output Controller (PIOA) */
  PIOB_IRQn                 = 11 , /**< 11  SAMV71N21B Parallel Input/Output Controller (PIOB) */
  USART0_IRQn               = 13 , /**< 13  SAMV71N21B Universal Synchronous Asynchronous Receiver Transmitter (USART0) */
  USART1_IRQn               = 14 , /**< 14  SAMV71N21B Universal Synchronous Asynchronous Receiver Transmitter (USART1) */
  USART2_IRQn               = 15 , /**< 15  SAMV71N21B Universal Synchronous Asynchronous Receiver Transmitter (USART2) */
  PIOD_IRQn                 = 16 , /**< 16  SAMV71N21B Parallel Input/Output Controller (PIOD) */
  HSMCI_IRQn                = 18 , /**< 18  SAMV71N21B High Speed MultiMedia Card Interface (HSMCI) */
  TWIHS0_IRQn               = 19 , /**< 19  SAMV71N21B Two-wire Interface High Speed (TWIHS0) */
  TWIHS1_IRQn               = 20 , /**< 20  SAMV71N21B Two-wire Interface High Speed (TWIHS1) */
  SPI0_IRQn                 = 21 , /**< 21  SAMV71N21B Serial Peripheral Interface (SPI0) */
  SSC_IRQn                  = 22 , /**< 22  SAMV71N21B Synchronous Serial Controller (SSC) */
  TC0_IRQn                  = 23 , /**< 23  SAMV71N21B Timer Counter (TC0)      */
  TC1_IRQn                  = 24 , /**< 24  SAMV71N21B Timer Counter (TC0)      */
  TC2_IRQn                  = 25 , /**< 25  SAMV71N21B Timer Counter (TC0)      */
  TC3_IRQn                  = 26 , /**< 26  SAMV71N21B Timer Counter (TC1)      */
  TC4_IRQn                  = 27 , /**< 27  SAMV71N21B Timer Counter (TC1)      */
  TC5_IRQn                  = 28 , /**< 28  SAMV71N21B Timer Counter (TC1)      */
  AFEC0_IRQn                = 29 , /**< 29  SAMV71N21B Analog Front-End Controller (AFEC0) */
  DACC_IRQn                 = 30 , /**< 30  SAMV71N21B Digital-to-Analog Converter Controller (DACC) */
  PWM0_IRQn                 = 31 , /**< 31  SAMV71N21B Pulse Width Modulation Controller (PWM0) */
  ICM_IRQn                  = 32 , /**< 32  SAMV71N21B Integrity Check Monitor (ICM) */
  ACC_IRQn                  = 33 , /**< 33  SAMV71N21B Analog Comparator Controller (ACC) */
  USBHS_IRQn                = 34 , /**< 34  SAMV71N21B USB High-Speed Interface (USBHS) */
  MCAN0_INT0_IRQn           = 35 , /**< 35  SAMV71N21B Controller Area Network (MCAN0) */
  MCAN0_INT1_IRQn           = 36 , /**< 36  SAMV71N21B Controller Area Network (MCAN0) */
  MCAN1_INT0_IRQn           = 37 , /**< 37  SAMV71N21B Controller Area Network (MCAN1) */
  MCAN1_INT1_IRQn           = 38 , /**< 38  SAMV71N21B Controller Area Network (MCAN1) */
  GMAC_IRQn                 = 39 , /**< 39  SAMV71N21B Gigabit Ethernet MAC (GMAC) */
  AFEC1_IRQn                = 40 , /**< 40  SAMV71N21B Analog Front-End Controller (AFEC1) */
  TWIHS2_IRQn               = 41 , /**< 41  SAMV71N21B Two-wire Interface High Speed (TWIHS2) */
  QSPI_IRQn                 = 43 , /**< 43  SAMV71N21B Quad Serial Peripheral Interface (QSPI) */
  UART2_IRQn                = 44 , /**< 44  SAMV71N21B Universal Asynchronous Receiver Transmitter (UART2) */
  UART3_IRQn                = 45 , /**< 45  SAMV71N21B Universal Asynchronous Receiver Transmitter (UART3) */
  UART4_IRQn                = 46 , /**< 46  SAMV71N21B Universal Asynchronous Receiver Transmitter (UART4) */
  TC6_IRQn                  = 47 , /**< 47  SAMV71N21B Timer Counter (TC2)      */
  TC7_IRQn                  = 48 , /**< 48  SAMV71N21B Timer Counter (TC2)      */
  TC8_IRQn                  = 49 , /**< 49  SAMV71N21B Timer Counter (TC2)      */
  TC9_IRQn                  = 50 , /**< 50  SAMV71N21B Timer Counter (TC3)      */
  TC10_IRQn                 = 51 , /**< 51  SAMV71N21B Timer Counter (TC3)      */
  TC11_IRQn                 = 52 , /**< 52  SAMV71N21B Timer Counter (TC3)      */
  MLB_IRQn                  = 53 , /**< 53  SAMV71N21B MediaLB (MLB)            */
  AES_IRQn                  = 56 , /**< 56  SAMV71N21B Advanced Encryption Standard (AES) */
  TRNG_IRQn                 = 57 , /**< 57  SAMV71N21B True Random Number Generator (TRNG) */
  XDMAC_IRQn                = 58 , /**< 58  SAMV71N21B Extensible DMA Controller (XDMAC) */
  ISI_IRQn                  = 59 , /**< 59  SAMV71N21B Image Sensor Interface (ISI) */
  PWM1_IRQn                 = 60 , /**< 60  SAMV71N21B Pulse Width Modulation Controller (PWM1) */
  FPU_IRQn                  = 61 , /**< 61  SAMV71N21B Floating Point Unit (FPU) */
  RSWDT_IRQn                = 63 , /**< 63  SAMV71N21B Reinforced Safety Watchdog Timer (RSWDT) */
  CCW_IRQn                  = 64 , /**< 64  SAMV71N21B System Control Block (SCB) */
  CCF_IRQn                  = 65 , /**< 65  SAMV71N21B System Control Block (SCB) */
  GMAC_Q1_IRQn              = 66 , /**< 66  SAMV71N21B Gigabit Ethernet MAC (GMAC) */
  GMAC_Q2_IRQn              = 67 , /**< 67  SAMV71N21B Gigabit Ethernet MAC (GMAC) */
  IXC_IRQn                  = 68 , /**< 68  SAMV71N21B Floating Point Unit (FPU) */
  I2SC0_IRQn                = 69 , /**< 69  SAMV71N21B Inter-IC Sound Controller (I2SC0) */
  GMAC_Q3_IRQn              = 71 , /**< 71  SAMV71N21B Gigabit Ethernet MAC (GMAC) */
  GMAC_Q4_IRQn              = 72 , /**< 72  SAMV71N21B Gigabit Ethernet MAC (GMAC) */
  GMAC_Q5_IRQn              = 73 , /**< 73  SAMV71N21B Gigabit Ethernet MAC (GMAC) */

  PERIPH_COUNT_IRQn        = 74  /**< Number of peripheral IDs */
} IRQn_Type;
